demos/src/main/resources/archives/wsejb-example.jar/META-INF/wsdl/EndpointService.wsdl

<?xml version="1.0" ?><wsdl:definitions name="EndpointService" targetNamespace="http://archive.ws.demos.as.jboss.org/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://archive.ws.demos.as.jboss.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:message name="echoString">
    <wsdl:part name="arg0" type="xsd:string">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="echoStringResponse">
    <wsdl:part name="return" type="xsd:string">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="Endpoint">
    <wsdl:operation name="echoString">
      <wsdl:input message="tns:echoString" name="echoString">
    </wsdl:input>
      <wsdl:output message="tns:echoStringResponse" name="echoStringResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="EndpointServiceSoapBinding" type="tns:Endpoint">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"></soap:binding>
    <wsdl:operation name="echoString">
      <soap:operation soapAction="urn:EchoString" style="rpc"></soap:operation>
      <wsdl:input name="echoString">
        <soap:body namespace="http://archive.ws.demos.as.jboss.org/" use="literal"></soap:body>
      </wsdl:input>
      <wsdl:output name="echoStringResponse">
        <soap:body namespace="http://archive.ws.demos.as.jboss.org/" use="literal"></soap:body>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="EndpointService">
    <wsdl:port binding="tns:EndpointServiceSoapBinding" name="EndpointPort">
      <soap:address location="http://localhost:8080/wsejb-example"></soap:address>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>