testsuite_smoke_src_test_java_org_jboss_as_test_embedded_demos_ws_WSTestCase.java/[CN]/WSTestCase/[MT]/testLegacyServlet()/body

{
  final String request="<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:arc=\"http://archive.ws.demos.as.jboss.org/\">" + "  <soapenv:Header/>" + "  <soapenv:Body>"+ "    <arc:echoString>"+ "      <arg0>Foo</arg0>"+ "    </arc:echoString>"+ "  </soapenv:Body>"+ "</soapenv:Envelope>";
  String s=performCall("",request);
  Assert.assertNotNull(s);
  Assert.assertTrue(s.contains("echoStringResponse"));
  Assert.assertTrue(s.contains("Foo"));
}
